/**
 * echarts数据
 * Created by 16846 on 2021/3/18.
 */
export const jsonData = {}

jsonData.chartMenu = [
    {
        label: '全国I-III类水质占比劣势变化趋势',
        value: 'chart0'
    },
    {
        label: '全国劣V类水质占比劣势变化趋势',
        value: 'chart1'
    },
]


jsonData.getChartValue = function(val,that) {
    if (!val) {
        return ''
    }
    var str = val.toString()
    var typeMap = new Map([
        ['chart0', {
            myTool1: {
                show: true,
                title: '查看表格数据',
                icon:
                    'path://M896.4374528 416.169984c0-26.673152-21.6236032-48.2967552-48.2967552-48.2967552H630.8069376c-26.673152 0-48.2967552 21.6236032-48.2967552 48.2967552v83.04831147H384.69522773l-2.71428266-5.36849067c-41.336832-87.44686933-35.95195733-204.128256 150.601728-199.94487467v108.91537067l172.19037866-164.757504L532.58267307 73.2889088v106.57245867c-228.64418133-5.70709333-263.651328 183.517184-157.433856 314.01028266l4.6891008 5.34664534h-88.46595414c-26.673152 0-48.2967552 21.6236032-48.2967552 48.2967552v66.78882986h-98.43616426c-26.673152 0-40.4258816 21.6236032-30.71781547 48.2967552l79.10304427 217.33485227c9.70806613 26.673152 39.20145067 48.2967552 65.87460266 48.2967552h603.70670934c23.75898453 0 37.2506624-17.16169387 33.05745066-39.76178347 0.4980736-2.77108053 0.77441707-5.619712 0.77441707-8.53497173v-463.765504z m-60.37067093 306.4528896l-21.8464256-60.02223787c-9.70806613-26.673152-39.20145067-48.2967552-65.87460267-48.2967552H303.44697173v-30.56708266c0-13.336576 10.81125547-24.14783147 24.14783147-24.14783147h315.28605013v-107.1972352c0-13.336576 10.81125547-24.14783147 24.14783147-24.14783147h144.88917333c13.336576 0 24.14783147 10.81125547 24.14783147 24.14783147v270.2311424z',
                iconStyle: {
                    borderColor: '#3471df'
                },
                onclick: function (params) {
                    that.isShowTable = true
                    let val = {
                        title: '全国I-III类水质占比历史变化趋势',
                        name: '年份',
                        xData: params.option.xAxis[0].data,
                        yData: [
                            {
                                title: params.option.series[0].name + '(%)',
                                data: params.option.series[0].data.map((item, i) => {
                                    if (item.hasOwnProperty('value')) {
                                        return item.value
                                    } else {
                                        return item
                                    }
                                })
                            },
                            {
                                title: params.option.series[1].name + '(%)',
                                data: params.option.series[1].data.map((item, i) => {
                                    if (item.hasOwnProperty('value')) {
                                        return item.value
                                    } else {
                                        return item
                                    }
                                })
                            }
                        ]
                    }
                    that.$nextTick(() => {
                        that.$refs.tablePop.getData(val)
                    })
                }
            },
            saveAsImage: {
                //保存图片
                show: true,
                iconStyle: {
                    borderColor: '#3471df'
                }
            }
        }],
        ['chart1',{
            myTool1: {
                show: true,
                title: '查看表格数据',
                icon:
                    'path://M896.4374528 416.169984c0-26.673152-21.6236032-48.2967552-48.2967552-48.2967552H630.8069376c-26.673152 0-48.2967552 21.6236032-48.2967552 48.2967552v83.04831147H384.69522773l-2.71428266-5.36849067c-41.336832-87.44686933-35.95195733-204.128256 150.601728-199.94487467v108.91537067l172.19037866-164.757504L532.58267307 73.2889088v106.57245867c-228.64418133-5.70709333-263.651328 183.517184-157.433856 314.01028266l4.6891008 5.34664534h-88.46595414c-26.673152 0-48.2967552 21.6236032-48.2967552 48.2967552v66.78882986h-98.43616426c-26.673152 0-40.4258816 21.6236032-30.71781547 48.2967552l79.10304427 217.33485227c9.70806613 26.673152 39.20145067 48.2967552 65.87460266 48.2967552h603.70670934c23.75898453 0 37.2506624-17.16169387 33.05745066-39.76178347 0.4980736-2.77108053 0.77441707-5.619712 0.77441707-8.53497173v-463.765504z m-60.37067093 306.4528896l-21.8464256-60.02223787c-9.70806613-26.673152-39.20145067-48.2967552-65.87460267-48.2967552H303.44697173v-30.56708266c0-13.336576 10.81125547-24.14783147 24.14783147-24.14783147h315.28605013v-107.1972352c0-13.336576 10.81125547-24.14783147 24.14783147-24.14783147h144.88917333c13.336576 0 24.14783147 10.81125547 24.14783147 24.14783147v270.2311424z',
                iconStyle: {
                    borderColor: '#3471df'
                },
                onclick: function (params) {
                    that.isShowTable = true
                    let val = {
                        title: '全国劣V类水质占比历史变化趋势',
                        name: '年份',
                        xData: params.option.xAxis[0].data,
                        yData: [
                            {
                                title: params.option.series[0].name + '(%)',
                                data: params.option.series[0].data.map((item, i) => {
                                    if (item.hasOwnProperty('value')) {
                                        return item.value
                                    } else {
                                        return item
                                    }
                                })
                            },
                            {
                                title: params.option.series[1].name + '(%)',
                                data: params.option.series[1].data.map((item, i) => {
                                    if (item.hasOwnProperty('value')) {
                                        return item.value
                                    } else {
                                        return item
                                    }
                                })
                            }
                        ]
                    }
                    that.$nextTick(() => {
                        that.$refs.tablePop.getData(val)
                    })
                }
            },
            saveAsImage: {
                //保存图片
                show: true,
                iconStyle: {
                    borderColor: '#3471df'
                }
            }
        }],
    ])
    if (typeMap.get(str)) {
        return typeMap.get(str)
    } else {
        return ''
    }
}